burakenez/gd32e502-demo-suites-cmake-vscode/Projects/GD32E502C_START/06_TRIGSEL_TIMER_Trigger_EXTI/GD32E502.svd
        <register>
          <name>INTEN</name>
          <displayName>INTEN</displayName>
          <description>Interrupt enable register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MIEx</name>
              <description>Message transmission and reception interrupt enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>STAT</name>
          <displayName>STAT</displayName>
          <description>Status register</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MSx</name>
              <description>Mailbox x state</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MS7_RFO</name>
              <description>Mailbox 7 state / Rx FIFO overflow</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MS6_RFW</name>
              <description>Mailbox 6 state / Rx FIFO warning</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MS5_RFNE</name>
              <description>Mailbox 5 state / Rx FIFO not empty</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MS4_RES</name>
              <description>Mailbox 4 state / Reserved</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MS3_RES</name>
              <description>Mailbox 3 state / Reserved</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MS2_RES</name>
              <description>Mailbox 2 state / Reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MS1_RES</name>
              <description>Mailbox 1 state / Reserved</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MS0_RFC</name>
              <description>Mailbox 3 state / Clear Rx FIFO bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>

	<register>
          <name>CTL2</name>
          <displayName>CTL2</displayName>
          <description>Control register 2</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <resetValue>0x00A00000</resetValue>
          <fields>
            <field>
              <name>ERRFSIE</name>
              <description>Error summary interrupt enable bit for data phase of FD frames</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BORIE</name>
              <description>Bus off recovery interrupt enable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RFFN</name>
              <description>Rx FIFO filter number</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ASD</name>
              <description>Arbitration start delay</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RFO</name>
              <description>Receive filter order</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RRFRMS</name>
              <description>Remote request frame is stored</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IDERTR_RMF</name>
              <description>IDE and RTR field filter type for Rx mailbox reception</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ITSRC</name>
              <description>Internal counter source</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PREEN</name>
              <description>Protocol exception detection enable by CAN standard</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ISO</name>
              <description>ISO CAN FD</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EFDIS</name>
              <description>Edge filtering disable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WERRIE</name>
              <description>Write error interrupt enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
	<register>
          <name>CRCC</name>
          <displayName>CRCC</displayName>
          <description>CRC for classical frame register</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ANTM</name>
              <description>Associated number of mailbox for transmitting the CRCTC[14:0] value</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CRCTC</name>
              <description>Transmitted CRC value for classical frames</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>

	<register>
          <name>RFIFOPUBF</name>
          <displayName>RFIFOPUBF</displayName>
          <description>Receive FIFO public filter register</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FFDx</name>
              <description>Rx FIFO filter data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>

	<register>
          <name>RFIFOIFMN</name>
          <displayName>RFIFOIFMN</displayName>
          <description>Receive FIFO identifier filter matching number register</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IDFMN</name>
              <description>Identifier filter matching number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>

	<register>
          <name>BT</name>
          <displayName>BT</displayName>
          <description>Bit timing register</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BAUDPSC</name>
              <description>Baud rate prescaler</description>
              <bitOffset>21</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SJW</name>
              <description>Resynchronization jump width</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PTS</name>
              <description>Propagation time segment</description>
              <bitOffset>10</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PBS1</name>
              <description>Phase buffer segment 1</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PBS2</name>
              <description>Phase buffer segment 2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>

	<register>
          <name>RFIFOMPF0</name>
          <displayName>RFIFOMPF0</displayName>
          <description>Receive FIFO/mailbox private filter x register</description>
          <addressOffset>0x880</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FMFDx</name>
              <description>FIFO/mailbox filter data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>

	<register>
          <name>RFIFOMPF1</name>
          <displayName>RFIFOMPF1</displayName>
          <description>Receive FIFO/mailbox private filter x register</description>
          <addressOffset>0x884</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FMFDx</name>
              <description>FIFO/mailbox filter data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
	<register>
          <name>RFIFOMPF2</name>
          <displayName>RFIFOMPF2</displayName>
          <description>Receive FIFO/mailbox private filter x register</description>
          <addressOffset>0x888</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FMFDx</name>
              <description>FIFO/mailbox filter data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
	<register>
          <name>RFIFOMPF3</name>
          <displayName>RFIFOMPF3</displayName>
          <description>Receive FIFO/mailbox private filter x register</description>
          <addressOffset>0x88C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FMFDx</name>
              <description>FIFO/mailbox filter data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
	<register>
          <name>RFIFOMPF4</name>
          <displayName>RFIFOMPF4</displayName>
          <description>Receive FIFO/mailbox private filter x register</description>
          <addressOffset>0x890</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FMFDx</name>
              <description>FIFO/mailbox filter data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
	<register>
          <name>RFIFOMPF5</name>
          <displayName>RFIFOMPF5</displayName>
          <description>Receive FIFO/mailbox private filter x register</description>
          <addressOffset>0x894</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FMFDx</name>
              <description>FIFO/mailbox filter data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
	<register>
          <name>RFIFOMPF6</name>
          <displayName>RFIFOMPF6</displayName>
          <description>Receive FIFO/mailbox private filter x register</description>
          <addressOffset>0x898</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FMFDx</name>
              <description>FIFO/mailbox filter data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
	<register>
          <name>RFIFOMPF7</name>
          <displayName>RFIFOMPF7</displayName>
          <description>Receive FIFO/mailbox private filter x register</description>
          <addressOffset>0x89C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FMFDx</name>
              <description>FIFO/mailbox filter data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
	<register>
          <name>RFIFOMPF8</name>
          <displayName>RFIFOMPF8</displayName>
          <description>Receive FIFO/mailbox private filter x register</description>
          <addressOffset>0x8A0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FMFDx</name>
              <description>FIFO/mailbox filter data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
	<register>
          <name>RFIFOMPF9</name>
          <displayName>RFIFOMPF9</displayName>
          <description>Receive FIFO/mailbox private filter x register</description>
          <addressOffset>0x8A4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FMFDx</name>
              <description>FIFO/mailbox filter data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
	<register>
          <name>RFIFOMPF10</name>
          <displayName>RFIFOMPF10</displayName>
          <description>Receive FIFO/mailbox private filter x register</description>
          <addressOffset>0x8A8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FMFDx</name>
              <description>FIFO/mailbox filter data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
	<register>
          <name>RFIFOMPF11</name>
          <displayName>RFIFOMPF11</displayName>
          <description>Receive FIFO/mailbox private filter x register</description>
          <addressOffset>0x8AC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FMFDx</name>
              <description>FIFO/mailbox filter data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
	<register>
          <name>RFIFOMPF12</name>
          <displayName>RFIFOMPF12</displayName>
          <description>Receive FIFO/mailbox private filter x register</description>
          <addressOffset>0x8B0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FMFDx</name>
              <description>FIFO/mailbox filter data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
	<register>
          <name>RFIFOMPF13</name>
          <displayName>RFIFOMPF13</displayName>
          <description>Receive FIFO/mailbox private filter x register</description>
          <addressOffset>0x8B4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FMFDx</name>
              <description>FIFO/mailbox filter data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
	<register>
          <name>RFIFOMPF14</name>
          <displayName>RFIFOMPF14</displayName>
          <description>Receive FIFO/mailbox private filter x register</description>
          <addressOffset>0x8B8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FMFDx</name>
              <description>FIFO/mailbox filter data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
	<register>
          <name>RFIFOMPF15</name>
          <displayName>RFIFOMPF15</displayName>
          <description>Receive FIFO/mailbox private filter x register</description>
          <addressOffset>0x8BC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FMFDx</name>
              <description>FIFO/mailbox filter data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
	<register>
          <name>RFIFOMPF16</name>
          <displayName>RFIFOMPF16</displayName>
          <description>Receive FIFO/mailbox private filter x register</description>
          <addressOffset>0x8C0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FMFDx</name>
              <description>FIFO/mailbox filter data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
	<register>
          <name>RFIFOMPF17</name>
          <displayName>RFIFOMPF17</displayName>
          <description>Receive FIFO/mailbox private filter x register</description>
          <addressOffset>0x8C4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FMFDx</name>
              <description>FIFO/mailbox filter data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
	<register>
          <name>RFIFOMPF18</name>
          <displayName>RFIFOMPF18</displayName>
          <description>Receive FIFO/mailbox private filter x register</description>
          <addressOffset>0x8C8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FMFDx</name>
              <description>FIFO/mailbox filter data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
	<register>
          <name>RFIFOMPF19</name>
          <displayName>RFIFOMPF19</displayName>
          <description>Receive FIFO/mailbox private filter x register</description>
          <addressOffset>0x8CC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FMFDx</name>
              <description>FIFO/mailbox filter data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
	<register>
          <name>RFIFOMPF20</name>
          <displayName>RFIFOMPF20</displayName>
          <description>Receive FIFO/mailbox private filter x register</description>
          <addressOffset>0x8D0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FMFDx</name>
              <description>FIFO/mailbox filter data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
