burakenez/gd32e502-demo-suites-cmake-vscode/Projects/GD32E502C_START/06_TRIGSEL_TIMER_Trigger_EXTI/GD32E502.svd
	<register>
          <name>RFIFOMPF21</name>
          <displayName>RFIFOMPF21</displayName>
          <description>Receive FIFO/mailbox private filter x register</description>
          <addressOffset>0x8D4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FMFDx</name>
              <description>FIFO/mailbox filter data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
	<register>
          <name>RFIFOMPF22</name>
          <displayName>RFIFOMPF22</displayName>
          <description>Receive FIFO/mailbox private filter x register</description>
          <addressOffset>0x8D8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FMFDx</name>
              <description>FIFO/mailbox filter data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
	<register>
          <name>RFIFOMPF23</name>
          <displayName>RFIFOMPF23</displayName>
          <description>Receive FIFO/mailbox private filter x register</description>
          <addressOffset>0x8DC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FMFDx</name>
              <description>FIFO/mailbox filter data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
	<register>
          <name>RFIFOMPF24</name>
          <displayName>RFIFOMPF24</displayName>
          <description>Receive FIFO/mailbox private filter x register</description>
          <addressOffset>0x8E0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FMFDx</name>
              <description>FIFO/mailbox filter data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
	<register>
          <name>RFIFOMPF25</name>
          <displayName>RFIFOMPF25</displayName>
          <description>Receive FIFO/mailbox private filter x register</description>
          <addressOffset>0x8E4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FMFDx</name>
              <description>FIFO/mailbox filter data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
	<register>
          <name>RFIFOMPF26</name>
          <displayName>RFIFOMPF26</displayName>
          <description>Receive FIFO/mailbox private filter x register</description>
          <addressOffset>0x8E8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FMFDx</name>
              <description>FIFO/mailbox filter data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
	<register>
          <name>RFIFOMPF27</name>
          <displayName>RFIFOMPF27</displayName>
          <description>Receive FIFO/mailbox private filter x register</description>
          <addressOffset>0x8EC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FMFDx</name>
              <description>FIFO/mailbox filter data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
	<register>
          <name>RFIFOMPF28</name>
          <displayName>RFIFOMPF28</displayName>
          <description>Receive FIFO/mailbox private filter x register</description>
          <addressOffset>0x8F0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FMFDx</name>
              <description>FIFO/mailbox filter data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
	<register>
          <name>RFIFOMPF29</name>
          <displayName>RFIFOMPF29</displayName>
          <description>Receive FIFO/mailbox private filter x register</description>
          <addressOffset>0x8F4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FMFDx</name>
              <description>FIFO/mailbox filter data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
	<register>
          <name>RFIFOMPF30</name>
          <displayName>RFIFOMPF30</displayName>
          <description>Receive FIFO/mailbox private filter x register</description>
          <addressOffset>0x8F8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FMFDx</name>
              <description>FIFO/mailbox filter data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
	<register>
          <name>RFIFOMPF31</name>
          <displayName>RFIFOMPF31</displayName>
          <description>Receive FIFO/mailbox private filter x register</description>
          <addressOffset>0x8FC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FMFDx</name>
              <description>FIFO/mailbox filter data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>

	<register>
          <name>SLP_CTL0</name>
          <displayName>SLP_CTL0</displayName>
          <description>CAN_sleep mode control register 0</description>
          <addressOffset>0xB00</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000100</resetValue>
          <fields>
            <field>
              <name>WTOIE</name>
              <description>Wakeup timeout interrupt enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WMIE</name>
              <description>Wakeup match interrupt enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NMM</name>
              <description>Number of messages matching times</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATAFT</name>
              <description>DATA field filtering type in CAN_sleep mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IDFT</name>
              <description>ID field filtering type in CAN_sleep mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FFT</name>
              <description>Frame filtering type in CAN_sleep mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>

	<register>
          <name>SLP_TO</name>
          <displayName>SLP_TO</displayName>
          <description>CAN_sleep mode timeout register</description>
          <addressOffset>0xB04</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>WTO</name>
              <description>Wakeup timeout</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>

	<register>
          <name>SLP_STAT</name>
          <displayName>SLP_STAT</displayName>
          <description>CAN_sleep mode status register </description>
          <addressOffset>0xB08</addressOffset>
          <size>0x20</size>
          <resetValue>0X00000000</resetValue>
          <fields>
            <field>
              <name>WTOS</name>
              <description>Wakeup timeout flag status</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WMS</name>
              <description>Wakeup match flag status</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MMCNT</name>
              <description>Matching message counter in CAN_sleep mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MMCNTS</name>
              <description>Matching message counter state</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>

	<register>
          <name>SLP_EID0</name>
          <displayName>SLP_EID0</displayName>
          <description>CAN_sleep mode expected identifier 0 register</description>
          <addressOffset>0xB0C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EIDE</name>
              <description>Expected IDE in CAN_sleep mode</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERTR</name>
              <description>Expected RTR in CAN_sleep mode</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EIDF_ELT</name>
              <description>Expected ID field / expected ID low threshold in CAN_sleep mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>29</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>

	<register>
          <name>SLP_EDLC</name>
          <displayName>SLP_EDLC</displayName>
          <description>CAN_sleep mode expected DLC register</description>
          <addressOffset>0xB10</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000008</resetValue>
          <fields>
            <field>
              <name>DLCELT</name>
              <description>DLC expected low threshold in CAN_sleep mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DLCEHT</name>
              <description>DLC expected high threshold in CAN_sleep mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>

	<register>
          <name>SLP_EDL0</name>
          <displayName>SLP_EDL0</displayName>
          <description>CAN_sleep mode expected data low 0 register</description>
          <addressOffset>0xB14</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DB0ELT</name>
              <description>Data byte 0 expected low threshold in CAN_sleep mode</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DB1ELT</name>
              <description>Data byte 1 expected low threshold in CAN_sleep mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DB2ELT</name>
              <description>Data byte 2 expected low threshold in CAN_sleep mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DB3ELT</name>
              <description>Data byte 3 expected low threshold in CAN_sleep mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>

	<register>
          <name>SLP_EDL1</name>
          <displayName>SLP_EDL1</displayName>
          <description>CAN_sleep mode expected data low 1 register</description>
          <addressOffset>0xB18</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DB4ELT</name>
              <description>Data byte 4 expected low threshold in CAN_sleep mode</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DB5ELT</name>
              <description>Data byte 5 expected low threshold in CAN_sleep mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DB6ELT</name>
              <description>Data byte 6 expected low threshold in CAN_sleep mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DB7ELT</name>
              <description>Data byte 7 expected low threshold in CAN_sleep mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>

	<register>
          <name>IFEID1</name>
          <displayName>IFEID1</displayName>
          <description>CAN_sleep mode identifier filter / expected identifier 1 register</description>
          <addressOffset>0xB1C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IDEFD</name>
              <description>IDE filter data in CAN_sleep mode</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTRFD</name>
              <description>RTR filter data in CAN_sleep mode</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IDFD_EHT</name>
              <description>ID filter data / ID expected high threshold in CAN_sleep mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>29</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>

	<register>
          <name>SLP_DF0EDH0</name>
          <displayName>SLP_DF0EDH0</displayName>
          <description>CAN_sleep mode data 0 filter / expected data high 0 register</description>
          <addressOffset>0xB20</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DB0FD_EHT</name>
              <description>Data byte 0 filter data / Data byte 0 expected high threshold in CAN_sleep mode</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DB1FD_EHT</name>
              <description>Data byte 1 filter data / Data byte 1 expected high threshold in CAN_sleep mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DB2FD_EHT</name>
              <description>Data byte 3 filter data / Data byte 3 expected high threshold in CAN_sleep mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DB3FD_EHT</name>
              <description>Data byte 3 filter data / Data byte 3 expected high threshold in CAN_sleep mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>

	<register>
          <name>SLP_DF1EDH1</name>
          <displayName>SLP_DF1EDH1</displayName>
          <description>CAN_sleep mode data 1 filter / expected data high 1 register</description>
          <addressOffset>0xB24</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DB4FD_EHT</name>
              <description>Data byte 4 filter data / Data byte 4 expected high threshold in CAN_sleep mode</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DB5FD_EHT</name>
              <description>Data byte 5 filter data / Data byte 5 expected high threshold in CAN_sleep mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DB6FD_EHT</name>
              <description>Data byte 6 filter data / Data byte 6 expected high threshold in CAN_sleep mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DB7FD_EHT</name>
              <description>Data byte 7 filter data / Data byte 7 expected high threshold in CAN_sleep mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>

	<register>
          <name>RWM0CS</name>
          <displayName>RWM0CS</displayName>
          <description>CAN_sleep mode received wakeup mailbox x control status information register</description>
          <addressOffset>0xB40</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RSRR</name>
              <description>Received SRR bit</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RIDE</name>
              <description>Received IDE bit</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RRTR</name>
              <description>Received RTR bit</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RDLC</name>
              <description>Received DLC bits</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>

	<register>
          <name>RWM1CS</name>
          <displayName>RWM1CS</displayName>
          <description>CAN_sleep mode received wakeup mailbox x control status information register</description>
          <addressOffset>0xB50</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RSRR</name>
              <description>Received SRR bit</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RIDE</name>
              <description>Received IDE bit</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RRTR</name>
              <description>Received RTR bit</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RDLC</name>
              <description>Received DLC bits</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>

