burakenez/gd32e502-demo-suites-cmake-vscode/Projects/GD32E502C_START/06_TRIGSEL_TIMER_Trigger_EXTI/GD32E502.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SYSCFG</name>
      <description>System configuration controller</description>
      <groupName>SYSCFG</groupName>
      <baseAddress>0x40010000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x0400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CFG0</name>
          <displayName>CFG0</displayName>
          <description>System configuration register 0</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BOOT0_PF0_RMP</name>
              <description>BOOT0 and PF0 remapping bit</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PA9_PA12_RMP</name>
              <description>PA9 and PA12 remapping bit for small packages</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BOOT_MODE</name>
              <description>Boot mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFG1</name>
          <displayName>CFG1</displayName>
          <description>System configuration register 1</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ADC0CH9RMP</name>
              <description>ADC0 channel 9 remapping bit</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADC0CH8RMP</name>
              <description>ADC0 channel 8 remapping bit</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADC1CH15RMP</name>
              <description>ADC1 channel 15 remapping bit</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADC1CH14RMP</name>
              <description>ADC1 channel 14 remapping bit</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTISS0</name>
          <displayName>EXTISS0</displayName>
          <description>EXTI sources selection register
          0</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EXTI3_SS</name>
              <description>EXTI 3 sources selection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>EXTI2_SS</name>
              <description>EXTI 2 sources selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>EXTI1_SS</name>
              <description>EXTI 1 sources selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>EXTI0_SS</name>
              <description>EXTI 0 sources selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTISS1</name>
          <displayName>EXTISS1</displayName>
          <description>EXTI sources selection register
          1</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EXTI7_SS</name>
              <description>EXTI 7 sources selection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>EXTI6_SS</name>
              <description>EXTI 6 sources selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>EXTI5_SS</name>
              <description>EXTI 5 sources selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>EXTI4_SS</name>
              <description>EXTI 4 sources selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTISS2</name>
          <displayName>EXTISS2</displayName>
          <description>EXTI sources selection register
          2</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EXTI11_SS</name>
              <description>EXTI 11 sources selection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>EXTI10_SS</name>
              <description>EXTI 10 sources selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>EXTI9_SS</name>
              <description>EXTI 9 sources selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>EXTI8_SS</name>
              <description>EXTI 8 sources selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTISS3</name>
          <displayName>EXTISS3</displayName>
          <description>EXTI sources selection register
          3</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EXTI15_SS</name>
              <description>EXTI 15 sources selection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>EXTI14_SS</name>
              <description>EXTI 14 sources selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>EXTI13_SS</name>
              <description>EXTI 13 sources selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>EXTI12_SS</name>
              <description>EXTI 12 sources selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFG2</name>
          <displayName>CFG2</displayName>
          <description>System configuration register 2</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LVD_LOCK</name>
              <description>LVD lock</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM_ECC_ERROR_LOCK</name>
              <description>SRAM ECC check error lock</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LOCKUP_LOCK</name>
              <description>Cortex-M33 LOCKUP output lock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>STAT</name>
          <displayName>STAT</displayName>
          <description>System status register</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NMIPINIF</name>
              <description>Interrupt flag from NMI pin</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CKMNMIIF</name>
              <description>HXTAL clock moniotor NMI interrupt flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
             <access>read-write</access>
            </field>
            <field>
              <name>FLASHECCIF</name>
              <description>Flash ECC interrupt flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
             <access>read-write</access>
            </field>
            <field>
              <name>SRAMECCSEIF</name>
              <description>SRAM single bit correction event flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
             <access>read-write</access>
            </field>
            <field>
              <name>SRAMECCMEIF</name>
              <description>SRAM multi-bits non-correction event flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
             <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CFG3</name>
          <displayName>CFG3</displayName>
          <description>System configuration register 3</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <resetValue>0x0000000F</resetValue>
          <fields>
            <field>
              <name>SRAMECCEADDR</name>
              <description>Record the faulting system address</description>
              <bitOffset>18</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SRAMECCSERRBITS</name>
              <description>Which one bit has an SRAM ECC single-bit correctable error </description>
              <bitOffset>12</bitOffset>
              <bitWidth>6</bitWidth>
             <access>read-only</access>
            </field>
            <field>
              <name>NMIPINIE</name>
              <description>NMI pin interrupt enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
             <access>read-write</access>
            </field>
            <field>
              <name>CKMNMIIE</name>
              <description>HXTAL clock moniotor NMI enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
             <access>read-write</access>
            </field>
            <field>
              <name>FLASHECCIE</name>
              <description>Flash ECC NMI enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
             <access>read-write</access>
            </field>
            <field>
              <name>SRAMECCSEIE</name>
              <description>SRAM single bit correction interrupt enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
             <access>read-write</access>
            </field>
            <field>
              <name>SRAMECCMEIE</name>
              <description>SRAM multi-bits non-correction interrupt enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
             <access>read-write</access>
            </field>
          </fields>
        </register>
         <register>
          <name>TIMERINSEL</name>
          <displayName>TIMERINSEL</displayName>
          <description>TIMER input source select register</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
           <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TIMER0_ETI_SEL</name>
              <description>TIMER0 external trigger select</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>TIMER7_ETI_SEL</name>
              <description>TIMER7 external trigger select</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>TIMER19_ETI_SEL</name>
              <description>TIMER19 external trigger select</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>TIMER20_ETI_SEL</name>
              <description>TIMER20 external trigger select</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>TIMER0_BRKIN0_SEL</name>
              <description>TIMER0 break input 0 select</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMER0_BRKIN1_SEL</name>
              <description>TIMER0 break input 1 select</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMER0_BRKIN2_SEL</name>
              <description>TIMER0 break input 2 select</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMER0_BRKIN3_SEL</name>
              <description>TIMER0 break input 3 select</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMER7_BRKIN0_SEL</name>
              <description>TIMER7 break input 0 select</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMER7_BRKIN1_SEL</name>
              <description>TIMER7 break input 1 select</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMER7_BRKIN2_SEL</name>
              <description>TIMER7 break input 2 select</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMER7_BRKIN3_SEL</name>
              <description>TIMER7 break input 3 select</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMER19_BRKIN0_SEL</name>
              <description>TIMER19 break input 0 select</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMER19_BRKIN1_SEL</name>
              <description>TIMER19 break input 1 select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMER19_BRKIN2_SEL</name>
              <description>TIMER19 break input 2 select</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMER19_BRKIN3_SEL</name>
              <description>TIMER19 break input 3 select</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMER20_BRKIN0_SEL</name>
              <description>TIMER20 break input 0 select</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMER20_BRKIN1_SEL</name>
              <description>TIMER20 break input 1 select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMER20_BRKIN2_SEL</name>
              <description>TIMER20 break input 2 select</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMER20_BRKIN3_SEL</name>
              <description>TIMER20 break input 3 select</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMER7_CH0N_SEL</name>
              <description>TIMER7 Channel 0 complementary input select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
