burakenez/gd32e502-demo-suites-cmake-vscode/Projects/GD32E502C_START/06_TRIGSEL_TIMER_Trigger_EXTI/GD32E502.svd
        <register>
          <name>CAN0</name>
          <displayName>CAN0</displayName>
          <description>Trigger selection for CAN0 register</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <resetValue>0x0000003A</resetValue>
          <fields>
            <field>
              <name>LK</name>
              <description>TRIGSEL register lock</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INSEL0</name>
              <description>Trigger input source selection for output0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN1</name>
          <displayName>CAN1</displayName>
          <description>Trigger selection for CAN1 register</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <resetValue>0x0000003A</resetValue>
          <fields>
            <field>
              <name>LK</name>
              <description>TRIGSEL register lock</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INSEL0</name>
              <description>Trigger input source selection for output0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>

    <peripheral>
      <name>MFCOM</name>
      <description>Multi-function communication Interface</description>
      <groupName>MFCOM</groupName>
      <baseAddress>0x40038400</baseAddress>
         <addressBlock>
         <offset>0x0</offset>
          <size>0x800</size>
          <usage>registers</usage>
          </addressBlock>
      <interrupt>
        <name>MFCOM</name>    
        <value>70</value>
      </interrupt>
          <registers>
             <register>
          <name>CTL</name>
          <displayName>CTL</displayName>
          <description>Control register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SWRSTEN</name>
              <description>Software reset enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MFCOMEN</name>
              <description>MFCOM enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
           <register>
          <name>PINDATA</name>
          <displayName>PINDATA</displayName>
          <description>Pin data register </description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PDATA</name>
              <description>Input data of pins</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SSTAT</name>
          <displayName>SSTAT</displayName>
          <description>Shifter status register</description>
          <addressOffset>0x08</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SSTAT</name>
              <description>Shifter x status flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SERR</name>
          <displayName>SERR</displayName>
          <description>Shifter error register</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SERR</name>
              <description>Shifter x error flags</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TMSTAT</name>
          <displayName>TMSTAT</displayName>
          <description>Timer status register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TMSTAT</name>
              <description>Timer x status flags</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SSIEN</name>
          <displayName>SSIEN</displayName>
          <description>Shifter status interrupt enable register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SSIEN</name>
              <description>Shifter status interrupt enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SEIEN</name>
          <displayName>SEIEN</displayName>
          <description>Shifter error interrupt enable register</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SEIEN</name>
              <description>Shifter error interrupt enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>

        <register>
          <name>TMSIEN</name>
          <displayName>TMSIEN</displayName>
          <description>Timer status interrupt enable register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TMSIEN</name>
              <description>Timer status interrupt enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>

       <register>
          <name>SSDMAEN</name>
          <displayName>SSDMAEN</displayName>
          <description>Shifter status DMA enable register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SSDMAEN</name>
              <description>Shifter status DMA enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
       <register>
          <name>SCTL0</name>
          <displayName>SCTL0</displayName>
          <description>Shifter control x register </description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TMSEL</name>
              <description>Timer select</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>TMPL</name>
              <description>Timer polarity</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPCFG</name>
              <description>Shifter pin configuration</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SPSEL</name>
              <description>Shifter pin select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SPPL</name>
              <description>Shifter pin polarity</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SMOD</name>
              <description>Shifter mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
       <register>
          <name>SCTL01</name>
          <displayName>SCTL1</displayName>
          <description>Shifter control x register </description>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TMSEL</name>
              <description>Timer select</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>TMPL</name>
              <description>Timer polarity</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPCFG</name>
              <description>Shifter pin configuration</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SPSEL</name>
              <description>Shifter pin select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SPPL</name>
              <description>Shifter pin polarity</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SMOD</name>
              <description>Shifter mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
       <register>
          <name>SCTL2</name>
          <displayName>SCTL2</displayName>
          <description>Shifter control x register </description>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TMSEL</name>
              <description>Timer select</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>TMPL</name>
              <description>Timer polarity</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPCFG</name>
              <description>Shifter pin configuration</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SPSEL</name>
              <description>Shifter pin select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SPPL</name>
              <description>Shifter pin polarity</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SMOD</name>
              <description>Shifter mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
       <register>
          <name>SCTL3</name>
          <displayName>SCTL3</displayName>
          <description>Shifter control x register </description>
          <addressOffset>0x8C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TMSEL</name>
              <description>Timer select</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>TMPL</name>
              <description>Timer polarity</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPCFG</name>
              <description>Shifter pin configuration</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SPSEL</name>
              <description>Shifter pin select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SPPL</name>
              <description>Shifter pin polarity</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SMOD</name>
              <description>Shifter mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
      <register>
          <name>SCFG0</name>
          <displayName>SCFG0</displayName>
          <description>Shifter configuration x register</description>
          <addressOffset>0x100</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INSRC</name>
              <description>Input source</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SSTOP</name>
              <description>Shifter stop bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SSTART</name>
              <description>Shifter start bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>

      <register>
          <name>SCFG1</name>
          <displayName>SCFG1</displayName>
          <description>Shifter configuration x register</description>
          <addressOffset>0x104</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INSRC</name>
              <description>Input source</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SSTOP</name>
              <description>Shifter stop bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SSTART</name>
              <description>Shifter start bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>

      <register>
          <name>SCFG2</name>
          <displayName>SCFG2</displayName>
          <description>Shifter configuration x register</description>
          <addressOffset>0x108</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INSRC</name>
              <description>Input source</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SSTOP</name>
              <description>Shifter stop bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SSTART</name>
              <description>Shifter start bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>

      <register>
          <name>SCFG3</name>
          <displayName>SCFG3</displayName>
          <description>Shifter configuration x register</description>
          <addressOffset>0x10C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INSRC</name>
              <description>Input source</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SSTOP</name>
              <description>Shifter stop bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SSTART</name>
              <description>Shifter start bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
         <register>
          <name>SBUF0</name>
          <displayName>SBUF0</displayName>
          <description>Shifter buffer x register </description>
          <addressOffset>0x200</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SBUF</name>
              <description>Shift buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
         <register>
          <name>SBUF1</name>
          <displayName>SBUF1</displayName>
          <description>Shifter buffer x register </description>
          <addressOffset>0x204</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SBUF</name>
              <description>Shift buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
         <register>
          <name>SBUF2</name>
          <displayName>SBUF2</displayName>
          <description>Shifter buffer x register </description>
          <addressOffset>0x208</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SBUF</name>
              <description>Shift buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
         <register>
          <name>SBUF3</name>
          <displayName>SBUF3</displayName>
          <description>Shifter buffer x register </description>
          <addressOffset>0x20C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SBUF</name>
              <description>Shift buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>

         <register>
          <name>SBUFBIS0</name>
          <displayName>SBUFBIS0</displayName>
          <description>Shifter buffer x bit swapped register</description>
          <addressOffset>0x280</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SBUFBIS</name>
              <description>Shift buffer bit swapped</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
         <register>
          <name>SBUFBIS1</name>
          <displayName>SBUFBIS1</displayName>
          <description>Shifter buffer x bit swapped register</description>
          <addressOffset>0x284</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SBUFBIS</name>
              <description>Shift buffer bit swapped</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
         <register>
          <name>SBUFBIS2</name>
          <displayName>SBUFBIS2</displayName>
          <description>Shifter buffer x bit swapped register</description>
          <addressOffset>0x288</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SBUFBIS</name>
              <description>Shift buffer bit swapped</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
         <register>
          <name>SBUFBIS3</name>
          <displayName>SBUFBIS3</displayName>
          <description>Shifter buffer x bit swapped register</description>
          <addressOffset>0x28C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SBUFBIS</name>
              <description>Shift buffer bit swapped</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>

         <register>
          <name>SBUFBYS0</name>
          <displayName>SBUFBYS0</displayName>
          <description>Shifter buffer x byte swapped register</description>
          <addressOffset>0x300</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SBUFBYS</name>
              <description>Shift buffer byte swapped</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
